apache/nuttx/arch/arm/src/lpc54xx/chip/lpc54_ethernet.h
#define ETH_MAC_CONFIG_RE                                (1 << 0)  /* Bit 0:  Receiver enable */
#define ETH_MAC_CONFIG_TE                                (1 << 1)  /* Bit 1:  Transmitter enable */
#define ETH_MAC_CONFIG_PRELEN_SHIFT                      (2)       /* Bits 2-3: Preamble length for transmit packets */
#define ETH_MAC_CONFIG_PRELEN_MASK                       (3 << ETH_MAC_CONFIG_PRELEN_SHIFT)
#  define ETH_MAC_CONFIG_PRELEN_7                        (0 << ETH_MAC_CONFIG_PRELEN_SHIFT) /* 7 bytes of preamble */
#  define ETH_MAC_CONFIG_PRELEN_5                        (1 << ETH_MAC_CONFIG_PRELEN_SHIFT) /* 5 bytes of preamble */
#  define ETH_MAC_CONFIG_PRELEN_3                        (2 << ETH_MAC_CONFIG_PRELEN_SHIFT) /* 3 bytes of preamble */
#define ETH_MAC_CONFIG_DC                                (1 << 4)  /* Bit 4: Deferral check */
#define ETH_MAC_CONFIG_BL_SHIFT                          (5)       /* Bits 5-6: Back-off limit */
#define ETH_MAC_CONFIG_BL_MASK                           (3 << ETH_MAC_CONFIG_BL_SHIFT)
#  define ETH_MAC_CONFIG_BL_10                           (0 << ETH_MAC_CONFIG_BL_SHIFT) /* k = min (n, 10) */
#  define ETH_MAC_CONFIG_BL_8                            (1 << ETH_MAC_CONFIG_BL_SHIFT) /* k = min (n, 8) */
#  define ETH_MAC_CONFIG_BL_4                            (2 << ETH_MAC_CONFIG_BL_SHIFT) /* k = min (n, 4) */
#  define ETH_MAC_CONFIG_BL_1                            (3 << ETH_MAC_CONFIG_BL_SHIFT) /* k = min (n, 1) */
#define ETH_MAC_CONFIG_DR                                (1 << 8)  /* Bit 8:  Disable retry */
#define ETH_MAC_CONFIG_DCRS                              (1 << 9)  /* Bit 9:  Disable carrier sense during transmission */
#define ETH_MAC_CONFIG_DO                                (1 << 10) /* Bit 10: Disable receive own */
#define ETH_MAC_CONFIG_ECRSFD                            (1 << 11) /* Bit 11: Enable carrier sense full-duplex mode before transmission */
#define ETH_MAC_CONFIG_LM                                (1 << 12) /* Bit 12: Loopback mode */
#define ETH_MAC_CONFIG_DM                                (1 << 13) /* Bit 13: Duplex mode */
#define ETH_MAC_CONFIG_FES                               (1 << 14) /* Bit 14: Speed */
#define ETH_MAC_CONFIG_PS                                (1 << 15) /* Bit 15: Port select */
#define ETH_MAC_CONFIG_JE                                (1 << 16) /* Bit 16: Jumbo frame enable */
#define ETH_MAC_CONFIG_JD                                (1 << 17) /* Bit 17: Jabber disable */
#define ETH_MAC_CONFIG_BE                                (1 << 18) /* Bit 18: Packet burst enable */
#define ETH_MAC_CONFIG_WD                                (1 << 19) /* Bit 19: Watchdog disable */
#define ETH_MAC_CONFIG_ACS                               (1 << 20) /* Bit 20: Automatic pad or CRC stripping */
#define ETH_MAC_CONFIG_CST                               (1 << 21) /* Bit 21: CRC stripping for type packets */
#define ETH_MAC_CONFIG_S2KP                              (1 << 22) /* Bit 22: IEEE 802.3as support for 2K packets */
#define ETH_MAC_CONFIG_GPSLCE                            (1 << 23) /* Bit 23: Giant packet size limit control enable */
#define ETH_MAC_CONFIG_IPG_SHIFT                         (24)       /* Bits 24-26: Inter-packet gap */
#define ETH_MAC_CONFIG_IPG_MASK                          (7 << ETH_MAC_CONFIG_IPG_SHIFT)
#  define ETH_MAC_CONFIG_IPG_96                          (0 << ETH_MAC_CONFIG_IPG_SHIFT) /* 96 bit times */
#  define ETH_MAC_CONFIG_IPG_88                          (1 << ETH_MAC_CONFIG_IPG_SHIFT) /* 88 bit times */
#  define ETH_MAC_CONFIG_IPG_80                          (2 << ETH_MAC_CONFIG_IPG_SHIFT) /* 80 bit times */
#  define ETH_MAC_CONFIG_IPG_72                          (3 << ETH_MAC_CONFIG_IPG_SHIFT) /* 72 bit times */
#  define ETH_MAC_CONFIG_IPG_64                          (4 << ETH_MAC_CONFIG_IPG_SHIFT) /* 64 bit times */
#  define ETH_MAC_CONFIG_IPG_56                          (5 << ETH_MAC_CONFIG_IPG_SHIFT) /* 56 bit times */
#  define ETH_MAC_CONFIG_IPG_48                          (6 << ETH_MAC_CONFIG_IPG_SHIFT) /* 48 bit times */
#  define ETH_MAC_CONFIG_IPG_40                          (7 << ETH_MAC_CONFIG_IPG_SHIFT) /* 40 bit times */
#define ETH_MAC_CONFIG_IPC                               (1 << 27) /* Bit 27: Checksum offload */

/* MAC extended configuration */
#define ETH_MAC_EXT_CONFIG_

/* MAC frame filter */

#define ETH_MAC_FRAME_FILTER_PR                          (1 << 0)  /* Bit 0:  Promiscuous mode */
#define ETH_MAC_FRAME_FILTER_DAIF                        (1 << 3)  /* Bit 3:  DA inverse filtering */
#define ETH_MAC_FRAME_FILTER_PM                          (1 << 4)  /* Bit 4:  Pass all multicast */
#define ETH_MAC_FRAME_FILTER_DBF                         (1 << 5)  /* Bit 5:  Disable broadcast frames */
#define ETH_MAC_FRAME_FILTER_PCF_SHIFT                   (6)       /* Bits 6-7: Pass control frames */
#define ETH_MAC_FRAME_FILTER_PCF_MASK                    (3 << ETH_MAC_FRAME_FILTER_PCF_SHIFT)
#  define ETH_MAC_FRAME_FILTER_PCF_NONE                  (0 << ETH_MAC_FRAME_FILTER_PCF_SHIFT) /* All control frames filtered */
#  define ETH_MAC_FRAME_FILTER_PCF_PAUSE                 (1 << ETH_MAC_FRAME_FILTER_PCF_SHIFT) /* All but pause control frames accepted */
#  define ETH_MAC_FRAME_FILTER_PCF_ALL                   (2 << ETH_MAC_FRAME_FILTER_PCF_SHIFT) /* All control frames accepted */
#  define ETH_MAC_FRAME_FILTER_PCF_FILTERED              (3 << ETH_MAC_FRAME_FILTER_PCF_SHIFT) /* Control frames accepted if pass the address filter */
#define ETH_MAC_FRAME_FILTER_SAIF                        (1 << 8)  /* Bit 8:  SA inverse filtering */
#define ETH_MAC_FRAME_FILTER_SAF                         (1 << 9)  /* Bit 9:  Source address filter enable */
#define ETH_MAC_FRAME_FILTER_RA                          (1 << 31) /* Bit 31:  Receive all */

/* MAC watchdog timeout */
#define ETH_MAC_WD_TIMEROUT_
/* VLAN tag */
#define ETH_MAC_VLAN_TAG_

/* Transmit flow control 0/1 */

#define ETH_MAC_TX_FLOW_CTRL_Q_FCB                       (1 << 0)  /* Bit 0:  Flow control busy/backpressure activate */
#define ETH_MAC_TX_FLOW_CTRL_Q_TFE                       (1 << 1)  /* Bit 1:  Transmit flow control enable */
#define ETH_MAC_TX_FLOW_CTRL_Q_PLT_SHIFT                 (4)       /* Bits 4-6: Pause low threshold */
#define ETH_MAC_TX_FLOW_CTRL_Q_PLT_MASK                  (7 << ETH_MAC_TX_FLOW_CTRL_Q_PLT_SHIFT)
#  define ETH_MAC_TX_FLOW_CTRL_Q_PLT(n)                  ((uint32_t)(n) << ETH_MAC_TX_FLOW_CTRL_Q_PLT_SHIFT)
#define ETH_MAC_TX_FLOW_CTRL_Q_DZPQ                      (1 << 7)  /* Bit 7:  Disable zero-quanta pause */
#define ETH_MAC_TX_FLOW_CTRL_Q_PT_SHIFT                  (16)      /* Bits 16-31: Pause time */
#define ETH_MAC_TX_FLOW_CTRL_Q_PT_MASK                   (0xffff << ETH_MAC_TX_FLOW_CTRL_Q_PT_SHIFT)
#  define ETH_MAC_TX_FLOW_CTRL_Q_PT(n)                   ((uint32_t)(n) << ETH_MAC_TX_FLOW_CTRL_Q_PT_SHIFT)

/* Receive flow control */

