apache/nuttx/arch/arm/src/lpc54xx/chip/lpc54_ethernet.h
#define ETH_MAC_RX_FLOW_CTRL_RFE                         (1 << 0)  /* Bit 0:  Receive flow control enable */
#define ETH_MAC_RX_FLOW_CTRL_UP                          (1 << 1)  /* Bit 1:  Unicast pause packet detect */

/* Transmit Queue priority mapping */

#define ETH_MAC_TXQ_PRIO_MAP_PSTQ0_SHIFT                 (0)       /* Bits 0-7: Priorities selected in Tx Queue 0 */
#define ETH_MAC_TXQ_PRIO_MAP_PSTQ0_MASK                  (0xff << ETH_MAC_TXQ_PRIO_MAP_PSTQ0_SHIFT)
#  define ETH_MAC_TXQ_PRIO_MAP_PSTQ0(n)                  ((uint32_t)(n) << ETH_MAC_TXQ_PRIO_MAP_PSTQ0_SHIFT)
#define ETH_MAC_TXQ_PRIO_MAP_PSTQ1_SHIFT                 (8)       /* Bits 8-15: Priorities selected in Tx Queue 1 */
#define ETH_MAC_TXQ_PRIO_MAP_PSTQ1_MASK                  (0xff << ETH_MAC_TXQ_PRIO_MAP_PSTQ1_SHIFT)
#  define ETH_MAC_TXQ_PRIO_MAP_PSTQ1(n)                  ((uint32_t)(n) << ETH_MAC_TXQ_PRIO_MAP_PSTQ1_SHIFT)

/* Receive Queue control 0 */

#define ETH_MAC_RXQ_CTRL0_RXQ0EN_SHIFT                   (0)       /* Bits 0-1: Rx Queue 0 enable */
#define ETH_MAC_RXQ_CTRL0_RXQ0EN_MASK                    (3 << ETH_MAC_RXQ_CTRL0_RXQ0EN_SHIFT)
#  define ETH_MAC_RXQ_CTRL0_RXQ0EN_DISABLE               (0 << ETH_MAC_RXQ_CTRL0_RXQ0EN_SHIFT) /* Disable */
#  define ETH_MAC_RXQ_CTRL0_RXQ0EN_ENABLE                (1 << ETH_MAC_RXQ_CTRL0_RXQ0EN_SHIFT) /* Queue 0 enabled for AV  */
#define ETH_MAC_RXQ_CTRL0_RXQ1EN_SHIFT                   (2)       /* Bits 2-3: Rx Queue 1 enable */
#define ETH_MAC_RXQ_CTRL0_RXQ1EN_MASK                    (3 << ETH_MAC_RXQ_CTRL0_RXQ1EN_SHIFT)
#  define ETH_MAC_RXQ_CTRL0_RXQ1EN_DISABLE               (0 << ETH_MAC_RXQ_CTRL0_RXQ1EN_SHIFT) /* Disable */
#  define ETH_MAC_RXQ_CTRL0_RXQ1EN_ENABLE                (1 << ETH_MAC_RXQ_CTRL0_RXQ1EN_SHIFT) /* Queue 1 enabled for AV */

/* Receive Queue control 1 */
#define ETH_MAC_RXQ_CTRL1_
/* Receive Queue control 2 */
#define ETH_MAC_RXQ_CTRL2_

/* Interrupt enable and interrupt status */

#define ETH_MAC_INTR_PHYI                                (1 << 3)  /* Bit 3:  PHY interrupt */
#define ETH_MAC_INTR_PMTI                                (1 << 4)  /* Bit 4:  PMT interrupt */
#define ETH_MAC_INTR_LPII                                (1 << 5)  /* Bit 5:  LPI interrupt */
#define ETH_MAC_INTR_TSI                                 (1 << 12) /* Bit 12: Timestamp interrupt */
#define ETH_MAC_INTR_TXSTSI                              (1 << 13) /* Bit 13: Transmit status interrupt */
#define ETH_MAC_INTR_RXSTSI                              (1 << 14) /* Bit 14: Receive status interrupt */

/* Receive transmit status */
#define ETH_MAC_RXTX_STAT_
/* MAC PMT control and status */
#define ETH_MAC_PMT_CRTL_STAT_
/* Wake-up packet filter */
#define ETH_MAC_RWK_PKT_FLT_
/* LPI control and status */
#define ETH_MAC_LPI_CTRL_STAT_
/* LPI timers control */
#define ETH_MAC_LPI_TIMER_CTRL_
/* LPI entry timer */
#define ETH_MAC_LPI_ENTR_TIMR_

/* MAC 1 usec tick counter */

#define ETH_MAC_1US_TIC_COUNTR_SHIFT                     (0)       /* Bits 0-11: 1uS TIC counter */
#define ETH_MAC_1US_TIC_COUNTR_MASK                      (0xfff << ETH_MAC_1US_TIC_COUNTR_SHIFT)
#  define ETH_MAC_1US_TIC_COUNTR(n)                      ((uint32_t)((n)-1) << ETH_MAC_1US_TIC_COUNTR_SHIFT)

/* MAC version */
#define ETH_MAC_VERSION_
/* MAC debug */
#define ETH_MAC_DBG_
/* MAC hardware feature 0 */
#define ETH_MAC_HW_FEAT0_
/* MAC hardware feature 1 */
#define ETH_MAC_HW_FEAT1_
/* MAC hardware feature 2 */
#define ETH_MAC_HW_FEAT2_

/* MIDO address */

#define ETH_MAC_MDIO_ADDR_MB                             (1 << 0)  /* Bit 0  MII busy */
#define ETH_MAC_MDIO_ADDR_MOC_SHIFT                      (2)       /* Bits 2-3: MII operation command */
#define ETH_MAC_MDIO_ADDR_MOC_MASK                       (3 << ETH_MAC_MDIO_ADDR_MOC_SHIFT)
#  define ETH_MAC_MDIO_ADDR_MOC_WRITE                    (1 << ETH_MAC_MDIO_ADDR_MOC_SHIFT) /* Write */
#  define ETH_MAC_MDIO_ADDR_MOC_READ                     (3 << ETH_MAC_MDIO_ADDR_MOC_SHIFT) /* Read */
#define ETH_MAC_MDIO_ADDR_CR_SHIFT                       (8)       /* Bits 8-11: CSR clock range */
#define ETH_MAC_MDIO_ADDR_CR_MASK                        (15 << ETH_MAC_MDIO_ADDR_CR_SHIFT)
#  define ETH_MAC_MDIO_ADDR_CR_DIV42                     (0 << ETH_MAC_MDIO_ADDR_CR_SHIFT) /* CSR=60-100 MHz; MDC=CSR/42 */
#  define ETH_MAC_MDIO_ADDR_CR_DIV62                     (1 << ETH_MAC_MDIO_ADDR_CR_SHIFT) /* CSR=100-150 MHz; MDC=CSR/62 */
#  define ETH_MAC_MDIO_ADDR_CR_DIV16                     (2 << ETH_MAC_MDIO_ADDR_CR_SHIFT) /* CSR=20-35 MHz; MDC=CSR/16 */
#  define ETH_MAC_MDIO_ADDR_CR_DIV26                     (3 << ETH_MAC_MDIO_ADDR_CR_SHIFT) /* CSR=35-60 MHz; MDC=CSR/26 */
#define ETH_MAC_MDIO_ADDR_NTC_SHIFT                      (12)      /* Bits 12-14: Number of training clocks */
#define ETH_MAC_MDIO_ADDR_NTC_MASK                       (7 << ETH_MAC_MDIO_ADDR_NTC_SHIFT)
#  define ETH_MAC_MDIO_ADDR_NTC(n)                       ((uint32_t)(n) << ETH_MAC_MDIO_ADDR_NTC_SHIFT)
#define ETH_MAC_MDIO_ADDR_RDA_SHIFT                      (16)      /* Bits 16-20: Register/device address */
#define ETH_MAC_MDIO_ADDR_RDA_MASK                       (31 << ETH_MAC_MDIO_ADDR_RDA_SHIFT)
#  define ETH_MAC_MDIO_ADDR_RDA(n)                       ((uint32_t)(n) << ETH_MAC_MDIO_ADDR_RDA_SHIFT)
#define ETH_MAC_MDIO_ADDR_PA_SHIFT                       (21)      /* Bits  21-25: Physical layer address */
#define ETH_MAC_MDIO_ADDR_PA_MASK                        (31 << ETH_MAC_MDIO_ADDR_PA_SHIFT)
#  define ETH_MAC_MDIO_ADDR_PA(n)                        ((uint32_t)(n) << ETH_MAC_MDIO_ADDR_PA_SHIFT)
#define ETH_MAC_MDIO_ADDR_BTB                            (1 << 26) /* Bit 26  Back to back transactions */
#define ETH_MAC_MDIO_ADDR_PSE                            (1 << 27) /* Bit 27  Preamble suppression enable */

/* MDIO data */

#define ETH_MAC_MDIO_DATA_MASK                           0xffff    /* Bits 0-15: 16 bit PHY data */

/* MAC address0 high */

#define ETH_MAC_ADDR_HIGH_A32_47_SHIFT                   (0)       /* Bits 9-15: MAC address 32-47 */
#define ETH_MAC_ADDR_HIGH_A32_47_MASK                    (0xffff << ETH_MAC_ADDR_HIGH_A32_47_SHIFT)
#  define ETH_MAC_ADDR_HIGH_A32_47(n)                    ((uint32_t)(n) << ETH_MAC_ADDR_HIGH_A32_47_SHIFT)
#define ETH_MAC_ADDR_HIGH_DCS                            (1 << 16) /* Bit 16: DMA channel select */

/* MAC address0 low (32-bit MAC address 0-31) */

/* Timestamp control */
#define ETH_MAC_TIMESTAMP_CTRL_
/* Sub-second increment */
#define ETH_MAC_SUB_SCND_INCR_
/* System time seconds */
#define ETH_MAC_SYS_TIME_SCND_
/* System time nanoseconds */
#define ETH_MAC_SYS_TIME_NSCND_
/* System time seconds update */
#define ETH_MAC_SYS_TIME_SCND_UPD_
/* System time nanoseconds update */
#define ETH_MAC_SYS_TIME_NSCND_UPD_
/* Timestamp addend */
#define ETH_MAC_SYS_TIMESTMP_ADDEND_
/* System time-higher word seconds */
#define ETH_MAC_SYS_TIME_HWORD_SCND_
/* Timestamp status */
#define ETH_MAC_SYS_TIMESTMP_STAT_
/* Tx timestamp status nanoseconds */
#define ETH_MAC_Tx_TIMESTAMP_STATUS_NSECS_
/* Tx timestamp status seconds */
#define ETH_MAC_Tx_TIMESTAMP_STATUS_SECS_
/* Timestamp ingress correction */
#define ETH_MAC_TIMESTAMP_INGRESS_CORR_NSEC_
/* Timestamp egress correction */
#define ETH_MAC_TIMESTAMP_EGRESS_CORR_NSEC_

/* MTL operation mode */

#define ETH_MTL_OP_MODE_DTXSTS                           (1 << 1)  /* Bit 1:  Drop transmit status */
#define ETH_MTL_OP_MODE_RAA                              (1 << 1)  /* Bit 2:  Receive arbitration algorithm */
#  define ETH_MTL_OP_MODE_RAA_SP                         (0)       /*         Strict priority */
#  define ETH_MTL_OP_MODE_RAA_WSP                        (1 << 1)  /*         Weighted Strict Priority */
#define ETH_MTL_OP_MODE_SHALG_SHIFT                      (5)       /* Bits 5-6:  Tx Scheduling Algorithm */
#define ETH_MTL_OP_MODE_SHALG_MASK                       (3 << ETH_MTL_OP_MODE_SHALG_SHIFT)
#  define ETH_MTL_OP_MODE_SHALG_SP                       (0 << ETH_MTL_OP_MODE_SHALG_SHIFT) /* Strict priority */
#  define ETH_MTL_OP_MODE_SHALG_WSP                      (3 << ETH_MTL_OP_MODE_SHALG_SHIFT) /* Weighted Strict */

/* MTL interrupt status */
#define ETH_MTL_INTR_STAT_

/* MTL Rx Queue and DMA channel mapping */

