apache/nuttx/arch/arm/src/lpc54xx/chip/lpc54_ethernet.h
#define ETH_MTL_RXQ_DMA_MAP_Q0MDMACH                     (1 << 0)  /* Bit 0:  Queue 0 mapped to DMA channel 1 */
#define ETH_MTL_RXQ_DMA_MAP_Q0DDMACH                     (1 << 4)  /* Bit 4:  Queue 0 enabled for DA-based DMA channel selection */
#define ETH_MTL_RXQ_DMA_MAP_Q1MDMACH                     (1 << 8)  /* Bit 8:  Queue 1 mapped to DMA channel 1 */
#define ETH_MTL_RXQ_DMA_MAP_Q1DDMACH                     (1 << 12) /* Bit 12: Queue 1 enabled for DA-based DMA channel selection */

/* MTL TxQn operation mode */

#define ETH_MTL_TXQ_OP_MODE_FTQ                          (1 << 0)  /* Bit 0:  Flush Tx Queue */
#define ETH_MTL_TXQ_OP_MODE_TSF                          (1 << 1)  /* Bit 1:  Transmit store and forward */
#define ETH_MTL_TXQ_OP_MODE_TXQEN_SHIFT                  (2)       /* Bits 2-3: Tx Queue enable */
#define ETH_MTL_TXQ_OP_MODE_TXQEN_MASK                   (3 << ETH_MTL_TXQ_OP_MODE_TXQEN_SHIFT)
#  define ETH_MTL_TXQ_OP_MODE_TXQEN_ENABLE               (0 << ETH_MTL_TXQ_OP_MODE_TXQEN_SHIFT) /* Not enabled */
#  define ETH_MTL_TXQ_OP_MODE_TXQEN_DISABLE              (2 << ETH_MTL_TXQ_OP_MODE_TXQEN_SHIFT) /* Enabled */
#define ETH_MTL_TXQ_OP_MODE_TTC_SHIFT                    (4)       /* Bits 4-6: Transmit threshold control */
#define ETH_MTL_TXQ_OP_MODE_TTC_MASK                     (7 << ETH_MTL_TXQ_OP_MODE_TTC_SHIFT)
#  define ETH_MTL_TXQ_OP_MODE_TTC_32                     (0 << ETH_MTL_TXQ_OP_MODE_TTC_SHIFT)
#  define ETH_MTL_TXQ_OP_MODE_TTC_64                     (1 << ETH_MTL_TXQ_OP_MODE_TTC_SHIFT)
#  define ETH_MTL_TXQ_OP_MODE_TTC_96                     (2 << ETH_MTL_TXQ_OP_MODE_TTC_SHIFT)
#  define ETH_MTL_TXQ_OP_MODE_TTC_128                    (3 << ETH_MTL_TXQ_OP_MODE_TTC_SHIFT)
#  define ETH_MTL_TXQ_OP_MODE_TTC_192                    (4 << ETH_MTL_TXQ_OP_MODE_TTC_SHIFT)
#  define ETH_MTL_TXQ_OP_MODE_TTC_256                    (5 << ETH_MTL_TXQ_OP_MODE_TTC_SHIFT)
#  define ETH_MTL_TXQ_OP_MODE_TTC_384                    (6 << ETH_MTL_TXQ_OP_MODE_TTC_SHIFT)
#  define ETH_MTL_TXQ_OP_MODE_TTC_512                    (7 << ETH_MTL_TXQ_OP_MODE_TTC_SHIFT)
#define ETH_MTL_TXQ_OP_MODE_TQS_SHIFT                    (16)      /* Bits 16-18: Tx Queue size (x256) */
#define ETH_MTL_TXQ_OP_MODE_TQS_MASK                     (7 << ETH_MTL_TXQ_OP_MODE_TQS_SHIFT)
#  define ETH_MTL_TXQ_OP_MODE_TQS(n)                     ((uint32_t)((n)-1) << ETH_MTL_TXQ_OP_MODE_TQS_SHIFT)

/* MTL TxQn underflow */
#define ETH_MTL_TXQ_UNDRFLW_
/* MTL TxQn debug */
#define ETH_MTL_TXQ_DBG_
/* MTL TxQ1 (only) ETS control */
#define ETH_MTL_TXQ1_ETS_CTRL_
/* MTL TxQn ETS status */
#define ETH_MTL_TXQ_ETS_STAT_

/* MTL TxQn idleSlopeCredit,quantum or weights */

#define ETH_MTL_TXQ_QNTM_WGHT_MASK                       0x001fffff /* Bits 0-20: IdleSlopeCredit, quantum or weights */

/* MTL TxQ1 (only) SendSlopCredit */
#define ETH_MTL_TXQ1_SNDSLP_CRDT_
/* MTL TxQ1 (only) hiCredit */
#define ETH_MTL_TXQ1_HI_CRDT_
/* MTL TxQ1 (only) loCredit */
#define ETH_MTL_TXQ1_LO_CRDT_
/* MTL TxQn interrupt control status */
#define ETH_MTL_TXQ_INTCTRL_STAT_

/* MTL RxQn operation mode */

#define ETH_MTL_RXQ_OP_MODE_RTC_SHIFT                    (0)       /* Bits 0-1:  Rx Queue threshold control */
#define ETH_MTL_RXQ_OP_MODE_RTC_MASK                     (3 << ETH_MTL_RXQ_OP_MODE_RTC_SHIFT)
#  define ETH_MTL_RXQ_OP_MODE_RTC_64                     (0 << ETH_MTL_RXQ_OP_MODE_RTC_SHIFT)
#  define ETH_MTL_RXQ_OP_MODE_RTC_32                     (1 << ETH_MTL_RXQ_OP_MODE_RTC_SHIFT)
#  define ETH_MTL_RXQ_OP_MODE_RTC_96                     (2 << ETH_MTL_RXQ_OP_MODE_RTC_SHIFT)
#  define ETH_MTL_RXQ_OP_MODE_RTC_128                    (3 << ETH_MTL_RXQ_OP_MODE_RTC_SHIFT)
#define ETH_MTL_RXQ_OP_MODE_FUP                          (1 << 3)  /* Bit 3  Forward undersized good packets */
#define ETH_MTL_RXQ_OP_MODE_FEP                          (1 << 4)  /* Bit 4  Forward error packets */
#define ETH_MTL_RXQ_OP_MODE_RSF                          (1 << 5)  /* Bit 5  Rx Queue store and forward */
#define ETH_MTL_RXQ_OP_MODE_DIS_TCP_EF                   (1 << 6)  /* Bit 6  Disable dropping of TCP/IP checksum error packets */
#define ETH_MTL_RXQ_OP_MODE_RQS_SHIFT                    (20)      /* Bits 20-22: Rx Queue size (x256) */
#define ETH_MTL_RXQ_OP_MODE_RQS_MASK                     (7 << ETH_MTL_RXQ_OP_MODE_RQS_SHIFT)
#  define ETH_MTL_RXQ_OP_MODE_RQS(n)                     ((uint32_t)((n)-1) << ETH_MTL_RXQ_OP_MODE_RQS_SHIFT)

/* MTL RxQn missed packet overflow counter */
#define ETH_MTL_RXQ_MISSPKT_OVRFLW_CNT_
/* MTL RxQn debug */
#define ETH_MTL_RXQ_DBG_

/* MTL RxQn control */

#define ETH_MTL_RXQ_CTRL_WEGT_SHIFT                      (0)       /* Bits 0-2: Rx Queue weight */
#define ETH_MTL_RXQ_CTRL_WEGT_MASK                       (7 << ETH_MTL_RXQ_CTRL_WEGT)
#  define ETH_MTL_RXQ_CTRL_WEGT(n)                       ((uint32_t)(n) << ETH_MTL_RXQ_CTRL_WEGT)
#define ETH_MTL_RXQ_CTRL_FRM_ARBIT                       (1 << 3)  /* Bit 3: Rx Queue packet arbitration */

/* DMA mode */

#define ETH_DMA_MODE_SWR                                 (1 << 0)  /* Bit 0:  Software reset */
#define ETH_DMA_MODE_DA_MASK                             (1 << 1)  /* Bit 1:  DMA Tx or Rx arbitration scheme */
#  define ETH_DMA_MODE_DA_WRR                            (0)       /* Weighted round-robin with Rx:Tx or Tx:Rx */
#  define ETH_DMA_MODE_DA_FIXED                          (1 << 1)  /* Fixed priority */
#define ETH_DMA_MODE_TAA_SHIFT                           (2)       /* Bits 2-4: Transmit arbitration algorithm */
#define ETH_DMA_MODE_TAA_MASK                            (7 << ETH_DMA_MODE_TAA_SHIFT)
#  define ETH_DMA_MODE_TAA_FIXED                         (0 << ETH_DMA_MODE_TAA_SHIFT) /* Fixed priority */
#  define ETH_DMA_MODE_TAA_WSP                           (1 << ETH_DMA_MODE_TAA_SHIFT) /* Weighted strict priority */
#  define ETH_DMA_MODE_TAA_WRR                           (2 << ETH_DMA_MODE_TAA_SHIFT) /* Weighted round-robin */
#define ETH_DMA_MODE_TXPR                                (1 << 11) /* Bit 11: Transmit priority */
#define ETH_DMA_MODE_PR_SHIFT                            (12)      /* Bits 12-14: Priority ratio */
#define ETH_DMA_MODE_PR_MASK                             (7 << ETH_DMA_MODE_PR_SHIFT)
# define ETH_DMA_MODE_PR_1TO1                            (0 << ETH_DMA_MODE_PR_SHIFT) /* Priority ratio is 1:1 */
# define ETH_DMA_MODE_PR_3TO1                            (2 << ETH_DMA_MODE_PR_SHIFT) /* Priority ratio is 3:1 */
# define ETH_DMA_MODE_PR_4TO1                            (3 << ETH_DMA_MODE_PR_SHIFT) /* Priority ratio is 4:1 */
# define ETH_DMA_MODE_PR_5TO1                            (4 << ETH_DMA_MODE_PR_SHIFT) /* Priority ratio is 5:1 */
# define ETH_DMA_MODE_PR_6TO1                            (5 << ETH_DMA_MODE_PR_SHIFT) /* Priority ratio is 6:1 */
# define ETH_DMA_MODE_PR_7TO1                            (6 << ETH_DMA_MODE_PR_SHIFT) /* Priority ratio is 7:1 */
# define ETH_DMA_MODE_PR_8TO1                            (7 << ETH_DMA_MODE_PR_SHIFT) /* Priority ratio is 8:1 */

/* DMA system bus mode */

