apache/nuttx/arch/arm/src/lpc54xx/chip/lpc54_ethernet.h
#define ETH_DMA_SYSBUS_MODE_FB                           (1 << 0)  /* Bit 0:  Fixed burst length */
#define ETH_DMA_SYSBUS_MODE_AAL                          (1 << 12) /* Bit 12: Address-aligned beats */
#define ETH_DMA_SYSBUS_MODE_MB                           (1 << 14) /* Bit 14: Mixed burst */
#define ETH_DMA_SYSBUS_MODE_RB                           (1 << 15) /* Bit 15: Rebuild INCRx burst */

/* DMA interrupt status */

#define ETH_DMA_INTR_STAT_DC0IS                          (1 << 0)  /* Bit 0:  DMA channel 0 interrupt status */
#define ETH_DMA_INTR_STAT_DC1IS                          (1 << 1)  /* Bit 1:  DMA channel 1 interrupt status */
#define ETH_DMA_INTR_STAT_MTLIS                          (1 << 16) /* Bit 16: MTL interrupt status */
#define ETH_DMA_INTR_STAT_MACIS                          (1 << 17) /* Bit 17: MAC interrupt status */

/* DMA debug status */
#define ETH_DMA_DBG_STAT_

/* DMA channel n control */

#define ETH_DMACH_CTRL_PBLx8                             (1 << 16) /* Bit 16: 8xPBL mode */
#define ETH_DMACH_CTRL_DSL_SHIFT                         (18)      /* Bits 18-20: Skip length */

/* DMA channel n transmit control */

#define ETH_DMACH_TX_CTRL_ST                             (1 << 0)  /* Bit 0:  Start or stop transmission command */
#define ETH_DMACH_TX_CTRL_TCW_SHIFT                      (1)       /* Bits 1-3: Transmit channel weight */
#define ETH_DMACH_TX_CTRL_TCW_MASK                       (7 << ETH_DMACH_TX_CTRL_TCW_SHIFT)
#  define ETH_DMACH_TX_CTRL_TCW(n)                       ((uint32_t)(n) << ETH_DMACH_TX_CTRL_TCW_SHIFT)
#define ETH_DMACH_TX_CTRL_OSF                            (1 << 4)  /* Bit 4:  Operate on second frame */
#define ETH_DMACH_TX_CTRL_TxPBL_SHIFT                    (16)      /* Bits 16-21: Transmit programmable burst length */
#define ETH_DMACH_TX_CTRL_TxPBL_MASK                     (0x3f << ETH_DMACH_TX_CTRL_TxPBL_SHIFT)
#  define ETH_DMACH_TX_CTRL_TxPBL(n)                     ((uint32_t)(n) << ETH_DMACH_TX_CTRL_TxPBL_SHIFT)

/* DMA channel n receive control */

#define ETH_DMACH_RX_CTRL_SR                             (1 << 0)  /* Bit 0:  Start or stop receive command */
#define ETH_DMACH_RX_CTRL_RBSZ_SHIFT                     (3)       /* Bits 3-14: Receive buffer size */
#define ETH_DMACH_RX_CTRL_RBSZ_MASK                      (0xfff << ETH_DMACH_RX_CTRL_RBSZ_SHIFT)
#  define ETH_DMACH_RX_CTRL_RBSZ(n)                      ((uint32_t)(n) << ETH_DMACH_RX_CTRL_RBSZ_SHIFT)
#define ETH_DMACH_RX_CTRL_RxPBL_SHIFT                    (16)      /* Bits 16-21: Receive programmable burst length */
#define ETH_DMACH_RX_CTRL_RxPBL_MASK                     (0x3f << ETH_DMACH_RX_CTRL_RxPBL_SHIFT)
#  define ETH_DMACH_RX_CTRL_RxPBL(n)                     ((uint32_t)(n) << ETH_DMACH_RX_CTRL_RxPBL_SHIFT)
#define ETH_DMACH_RX_CTRL_RPF                            (1 << 31) /* Bit 31: DMA Rx channel n packet flush */

/* DMA channel n Tx descriptor list address (32-bit, word-aligned address) */
/* DMA channel n Rx descriptor list address (32-bit, word-aligned address) */
/* DMA channel n Tx descriptor tail pointer (32-bit, word-aligned address) */
/* DMA channel n Rx descriptor tail pointer (32-bit, word-aligned address) */

/* DMA channel n Tx descriptor ring length */

#define ETH_DMACH_TXDESC_RING_LENGTH_SHIFT               (0)       /* Bits 0-9: Transmit ring length */
#define ETH_DMACH_TXDESC_RING_LENGTH_MASK                (0x3ff << ETH_DMACH_TXDESC_RING_LENGTH_SHIFT)
#  define ETH_DMACH_TXDESC_RING_LENGTH(n)                ((uint32_t)((n)-1) << ETH_DMACH_TXDESC_RING_LENGTH_SHIFT)

/* DMA channel n Rx descriptor ring length */

#define ETH_DMACH_RXDESC_RING_LENGTH_SHIFT               (0)       /* Bits 0-9: Receive ring length */
#define ETH_DMACH_RXDESC_RING_LENGTH_MASK                (0x3ff << ETH_DMACH_RXDESC_RING_LENGTH_SHIFT)
#  define ETH_DMACH_RXDESC_RING_LENGTH(n)                ((uint32_t)((n)-1) << ETH_DMACH_RXDESC_RING_LENGTH_SHIFT)

/* DMA channel n interrupt enable and DMA channel n DMA status */

#define ETH_DMACH_INT_TI                                 (1 << 0)  /* Bit 0:  Transmit interrupt */
#define ETH_DMACH_INT_TS                                 (1 << 1)  /* Bit 1:  Transmitter stopped */
#define ETH_DMACH_INT_TBU                                (1 << 2)  /* Bit 2:  Transmit buffer unavailable */
#define ETH_DMACH_INT_RI                                 (1 << 6)  /* Bit 6:  Receive interrupt */
#define ETH_DMACH_INT_RBU                                (1 << 7)  /* Bit 7:  Receive buffer unavailable */
#define ETH_DMACH_INT_RS                                 (1 << 8)  /* Bit 8:  Receiver stopped */
#define ETH_DMACH_INT_RWT                                (1 << 9)  /* Bit 9:  Receive watchdog timeout */
#define ETH_DMACH_INT_ETI                                (1 << 10) /* Bit 10: Early transmit interrupt */
#define ETH_DMACH_INT_ERI                                (1 << 11) /* Bit 11: Early receive interrupt */
#define ETH_DMACH_INT_FBE                                (1 << 12) /* Bit 12: Fatal bus error */
#define ETH_DMACH_INT_AI                                 (1 << 14) /* Bit 14: Abnormal interrupt summary */
#define ETH_DMACH_INT_NI                                 (1 << 15) /* Bit 15: Normal interrupt summary */

/* DMA channel n receive interrupt watchdog timer */
#define ETH_DMACH_RX_INT_WDTIMER_
/* DMA channel n slot function control and status */
#define ETH_DMACH_SLOT_FUNC_CTRL_STAT_
/* DMA channel n current host transmit descriptor */
#define ETH_DMACH_CUR_HST_TXDESC_
/* DMA channel n current host receive descriptor */
#define ETH_DMACH_CUR_HST_RXDESC_
/* DMA channel n current host transmit buffer address */
#define ETH_DMACH_CUR_HST_TXBUF_
/* DMA channel n current application receive buffer address */
#define ETH_DMACH_CUR_HST_RXBUF_

/* DMA channel n missed frame count */
#define ETH_DMACH_MISS_FRAME_CNT_

/* DMA descriptors ******************************************************************************************/

/* Receive descriptor (read-format) */
/* RDES0: 32-bit address */
/* RDES1: Reserved */
/* RDES2: 32-bit address */

/* RDES3: */

#define ETH_RXDES3_BUF1V                                 (1 << 24) /* Bit 24:  Buffer 1 address valid */
#define ETH_RXDES3_BUF2V                                 (1 << 25) /* Bit 25:  Buffer 1 address valid */
#define ETH_RXDES3_IOC                                   (1 << 30) /* Bit 30:  Interrupt enabled on completion */
#define ETH_RXDES3_OWN                                   (1 << 31) /* Bit 31:  Own bit */

/* Receive descriptor (writeback-format) */
/* RDES0: Reserved */

/* RDES1: */

