apache/nuttx/arch/arm/src/lpc54xx/chip/lpc54_ethernet.h
#define ETH_RXDES1_PT_SHIFT                              (0)       /* Bits 0-2: Payload type */
#define ETH_RXDES1_PT_MASK                               (7 << ETH_RXDES1_PT_SHIFT)
#  define ETH_RXDES1_PT_UNKNOWN                          (0 << ETH_RXDES1_PT_SHIFT) /* Unknown */
#  define ETH_RXDES1_PT_UDP                              (1 << ETH_RXDES1_PT_SHIFT) /* UDP */
#  define ETH_RXDES1_PT_TCP                              (2 << ETH_RXDES1_PT_SHIFT) /* TCP */
#  define ETH_RXDES1_PT_ICMP                             (3 << ETH_RXDES1_PT_SHIFT) /* ICMP */
#  define ETH_RXDES1_PT_IGMP                             (4 << ETH_RXDES1_PT_SHIFT) /* IGMP */
#  define ETH_RXDES1_PT_AVUCP                            (5 << ETH_RXDES1_PT_SHIFT) /* AV untagged control packet */
#  define ETH_RXDES1_PT_AVTDP                            (6 << ETH_RXDES1_PT_SHIFT) /* AV tagged data packet */
#  define ETH_RXDES1_PT_AVTCP                            (7 << ETH_RXDES1_PT_SHIFT) /* AV tagged control packet */
#define ETH_RXDES1_IPHE                                  (1 << 3)  /* Bit 3:  IP header error */
#define ETH_RXDES1_IPV4                                  (1 << 4)  /* Bit 4:  IPV4 header present */
#define ETH_RXDES1_IPV6                                  (1 << 5)  /* Bit 5:  IPv6 header present */
#define ETH_RXDES1_IPCB                                  (1 << 6)  /* Bit 6:  IP checksum bypassed */
#define ETH_RXDES1_IPCE                                  (1 << 7)  /* Bit 7:  IP payload error */
#define ETH_RXDES1_PMT_SHIFT                             (8)       /* Bits 8-11: PTP message type */
#define ETH_RXDES1_PMT_MASK                              (15 << ETH_RXDES1_PMT_SHIFT)
#  define ETH_RXDES1_PMT_NONE                            (0 << ETH_RXDES1_PMT_SHIFT)  /* No PTP message received */
#  define ETH_RXDES1_PMT_SYNC                            (1 << ETH_RXDES1_PMT_SHIFT)  /* SYNC */
#  define ETH_RXDES1_PMT_FOLLOWUP                        (2 << ETH_RXDES1_PMT_SHIFT)  /* Follow_Up */
#  define ETH_RXDES1_PMT_DELAYREQ                        (3 << ETH_RXDES1_PMT_SHIFT)  /* Delay Req */
#  define ETH_RXDES1_PMT_DELAYRESP                       (4 << ETH_RXDES1_PMT_SHIFT)  /* Delay Resp */
#  define ETH_RXDES1_PMT_PDELAYREQ                       (5 << ETH_RXDES1_PMT_SHIFT)  /* Pdelay Req */
#  define ETH_RXDES1_PMT_PDELAYRESP                      (6 << ETH_RXDES1_PMT_SHIFT)  /* Pdelay Resp */
#  define ETH_RXDES1_PMT_PDELAYFOLLOWUP                  (7 << ETH_RXDES1_PMT_SHIFT)  /* Pdelay Resp follow-up */
#  define ETH_RXDES1_PMT_ANNOUNCE                        (8 << ETH_RXDES1_PMT_SHIFT)  /* Announce */
#  define ETH_RXDES1_PMT_MGMNT                           (9 << ETH_RXDES1_PMT_SHIFT)  /* Management */
#  define ETH_RXDES1_PMT_SIGNALING                       (10 << ETH_RXDES1_PMT_SHIFT) /* Signaling */
#  define ETH_RXDES1_PMT_RESERVERD                       (15 << ETH_RXDES1_PMT_SHIFT) /* Reserved message type */
#define ETH_RXDES1_PFT                                   (1 << 12) /* Bit 12: PTP packet type */
#define ETH_RXDES1_PV                                    (1 << 13) /* Bit 13: PTP version */
#define ETH_RXDES1_TSA                                   (1 << 14) /* Bit 14: Timestamp available */
#define ETH_RXDES1_TD                                    (1 << 15) /* Bit 15: Timestamp dropped */
#define ETH_RXDES1_OPC_SHIFT                             (16)      /* Bits 16-31: OAM sub-type code */

/* RXDES2: */

#define ETH_RXDES2_SAF                                   (1 << 16) /* Bit 16: SA address filter fail */
#define ETH_RXDES2_DAF                                   (1 << 17) /* Bit 17: Destination address filter fail */
#define ETH_RXDES2_MADRM_SHIFT                           (19)      /* Bits 19-26: MAC address match */
#define ETH_RXDES2_MADRM_MASK                            (0xff << ETH_RXDES2_MADRM_SHIFT)

/* RXDES3: */

#define ETH_RXDES3_PL_SHIFT                              (0)       /* Bits 0-14: Packet length */
#define ETH_RXDES3_PL_MASK                               (0x7fff << ETH_RXDES3_PL_SHIFT)
#define ETH_RXDES3_ES                                    (1 << 15) /* Bit 15: Error summary */
#define ETH_RXDES3_LT_SHIFT                              (16)      /* Bits 16-18: Length/type */
#define ETH_RXDES3_LT_MASK                               (7 << ETH_RXDES3_LT_SHIFT)
#  define ETH_RXDES3_LT_PKTLEN                           (0 << ETH_RXDES3_LT_SHIFT) /* Packet is a length packet */
#  define ETH_RXDES3_LT_PKTTYPE                          (1 << ETH_RXDES3_LT_SHIFT) /* Packet is a type packet */
#  define ETH_RXDES3_LT_ARPREQ                           (3 << ETH_RXDES3_LT_SHIFT) /* Packet is a ARP request packet type */
#  define ETH_RXDES3_LT_VLAN                             (4 << ETH_RXDES3_LT_SHIFT) /* Packet is a type packet with VLAN tag */
#  define ETH_RXDES3_LT_DVLAN                            (5 << ETH_RXDES3_LT_SHIFT) /* Packet is a type packet with double VLAN tag */
#  define ETH_RXDES3_LT_CTRLPKT                          (6 << ETH_RXDES3_LT_SHIFT) /* Packet is a MAC control packet type */
#  define ETH_RXDES3_LT_OAM                              (7 << ETH_RXDES3_LT_SHIFT) /* Packet is a OAM packet type */
#define ETH_RXDES3_DE                                    (1 << 19) /* Bit 19: Dribble bit error */
#define ETH_RXDES3_RE                                    (1 << 20) /* Bit 20: Receive error */
#define ETH_RXDES3_OE                                    (1 << 21) /* Bit 21: Overflow error */
#define ETH_RXDES3_RWT                                   (1 << 22) /* Bit 22: Receive watchdog timeout */
#define ETH_RXDES3_GP                                    (1 << 23) /* Bit 23: Giant packet */
#define ETH_RXDES3_CE                                    (1 << 24) /* Bit 24: CRC error */
#define ETH_RXDES3_RS0V                                  (1 << 25) /* Bit 25: Receive status RDES0 valid */
#define ETH_RXDES3_RS1V                                  (1 << 26) /* Bit 26: Receive status RDES1 valid */
#define ETH_RXDES3_RS2V                                  (1 << 27) /* Bit 27: Receive status RDES2 valid */
#define ETH_RXDES3_LD                                    (1 << 28) /* Bit 28: Last descriptor */
#define ETH_RXDES3_FD                                    (1 << 29) /* Bit 29: First descriptor */
#define ETH_RXDES3_CTXT                                  (1 << 30) /* Bit 30: Receive context descriptor */
                                                                   /* Bit 31: Own bit (see read-format) */

/* Transmit normal descriptor (read-format) */
/* TDES0/1: 32-bit address */

/* TDES2: */

