apache/nuttx/arch/arm/src/lpc54xx/chip/lpc54_ethernet.h
#define ETH_TXDES2_B1L_SHIFT                             (0)       /* Bits 0-13: Buffer 1 length */
#define ETH_TXDES2_B1L_MASK                              (0x3fff << ETH_TXDES2_B1L_SHIFT)
#  define ETH_TXDES2_B1L(n)                              ((uint32_t)(n) << ETH_TXDES2_B1L_SHIFT)
#define ETH_TXDES2_B2L_SHIFT                             (16)      /* Bits 16-29: Buffer 2 length */
#define ETH_TXDES2_B2L_MASK                              (0x3fff << ETH_TXDES2_B2L_SHIFT)
#  define ETH_TXDES2_B2L(n)                              ((uint32_t)(n) << ETH_TXDES2_B2L_SHIFT)
#define ETH_TXDES2_TTSE                                  (1 << 30) /* Bit 30: Transmit timestamp enable */
#define ETH_TXDES2_IOC                                   (1 << 31) /* Bit 31: Interrupt on completion */

/* TDES3: */

#define ETH_TXDES3_FL_SHIFT                              (0)       /* Bits 0-14: Frame length */
#define ETH_TXDES3_FL_MASK                               (0x7fff << ETH_TXDES3_FL_SHIFT)
#  define ETH_TXDES3_FL(n)                               ((uint32_t)(n) << ETH_TXDES3_FL_SHIFT)
#define ETH_TXDES3_CIC_SHIFT                             (16)      /* Bits 16-17: Checksum insertion control */
#define ETH_TXDES3_CIC_MASK                              (3 << ETH_TXDES3_CIC_SHIFT)
#  define ETH_TXDES3_CIC_DISABLED                        (0 << ETH_TXDES3_CIC_SHIFT) /* Checksum insertion disabled */
#  define ETH_TXDES3_CIC_IPHDR                           (1 << ETH_TXDES3_CIC_SHIFT) /* Only IP header checksum */
#  define ETH_TXDES3_CIC_PAYLOAD                         (2 << ETH_TXDES3_CIC_SHIFT) /* IP header checksum and payload checksum */
#  define ETH_TXDES3_CIC_ALL                             (3 << ETH_TXDES3_CIC_SHIFT) /* IP Header checksum, payload, and pseudo-header checksum */
#define ETH_TXDES3_SLOTNUM_SHIFT                         (19)      /* Bits 19-22: Slot number control bits in AV mode */
#define ETH_TXDES3_SLOTNUM_MASK                          (15 << ETH_TXDES3_SLOTNUM_SHIFT)
#define ETH_TXDES3_CPC_SHIFT                             (26)      /* Bits 26-27: CRC pad control */
#define ETH_TXDES3_CPC_MASK                              (3 << ETH_TXDES2_B1L_SHIFT)
#  define ETH_TXDES3_CPC_CRCPAD                          (0 << ETH_TXDES2_B1L_SHIFT) /* CRC and pad insertion */
#  define ETH_TXDES3_CPC_CRC                             (1 << ETH_TXDES2_B1L_SHIFT) /* CRC insertion (disable pad insertion) */
#  define ETH_TXDES3_CPC_DISABLED                        (2 << ETH_TXDES2_B1L_SHIFT) /* Disable CRC insertion */
#  define ETH_TXDES3_CPC_REPLACMENT                      (3 << ETH_TXDES2_B1L_SHIFT) /* CRC replacement */
#define ETH_TXDES3_LD                                    (1 << 28) /* Bit 28: Last descriptor */
#define ETH_TXDES3_FD                                    (1 << 29) /* Bit 29: First descriptor */
#define ETH_TXDES3_CTXT                                  (1 << 30) /* Bit 30: Context type */
#define ETH_TXDES3_OWN                                   (1 << 31) /* Bit 31: Own bit */

/* Transmit normal descriptor (writeback-format) */
/* TDES0/1: 64-bit transmit packet timestamp */
/* TDES2: Reserved */

/* TDES3: */

#define ETH_TXDES3_IHE                                   (1 << 0)  /* Bit 0:  IP header error */
#define ETH_TXDES3_DB                                    (1 << 1)  /* Bit 1:  Deferred bit */
#define ETH_TXDES3_UF                                    (1 << 2)  /* Bit 2:  Underflow error */
#define ETH_TXDES3_ED                                    (1 << 3)  /* Bit 3:  Excessive deferral */
#define ETH_TXDES3_CC_SHIFT                              (4)       /* Bits 4-7: Collision count */
#define ETH_TXDES3_EC                                    (1 << 8)  /* Bit 8:  Excessive collision */
#define ETH_TXDES3_LC                                    (1 << 9)  /* Bit 9:  Late collision */
#define ETH_TXDES3_NC                                    (1 << 10) /* Bit 10: No carrier */
#define ETH_TXDES3_LOC                                   (1 << 11) /* Bit 11: Loss of carrier */
#define ETH_TXDES3_PCE                                   (1 << 12) /* Bit 12: Payload checksum error */
#define ETH_TXDES3_FF                                    (1 << 13) /* Bit 13: Packet flushed */
#define ETH_TXDES3_JT                                    (1 << 14) /* Bit 14: Jabber timeout */
#define ETH_TXDES3_ES                                    (1 << 15) /* Bit 15: Error summary */
#define ETH_TXDES3_TTSS                                  (1 << 17) /* Bit 17: Tx timestamp status */
                                                                   /* Bit 28: (see read format) */
                                                                   /* Bit 29: (see read format) */
                                                                   /* Bit 30: (see read format) */
                                                                   /* Bit 31: (see read format) */

/************************************************************************************************************
 * Public Types
 ************************************************************************************************************/

/* Receive descriptor structure (read format) */

struct enet_rxdesc_s
{
  uint32_t buffer1;   /* Buffer 1 address */
  uint32_t reserved;  /* Reserved */
  uint32_t buffer2;   /* Buffer 2 or next descriptor address */
  uint32_t ctrl;      /* Buffer 1/2 byte counts and control */
};

/* Transmit descriptor structure (read format) */

struct enet_txdesc_s
{
  uint32_t buffer1;   /* TDES0 Buffer 1 address */
  uint32_t buffer2;   /* TDES1 Buffer 2 address */
  uint32_t buflen;    /* TDES2 Buffer 1/2 byte counts */
  uint32_t ctrlstat;  /* TDES3 Control and status word */
};

#endif /* __ARCH_ARM_SRC_LPC54XX_CHIP_LPC54_ETHERNET_H */
